vsopSimulate/template/ChargingPolicySyncFromIsmpSV.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<SOAP-ENV:Body>
		<m:ChargingPolicySyncFromISMPReq xmlns:m="http://www.mbossvsop.com.cn/vsop">
			<request>
<![CDATA[
<Request>
	<SessionBody>
		<ChargingPolicySynFromISMPReq>
			<streamingNo>2010110309555512345678</streamingNo>
			<OPFlag>0</OPFlag>
			<chargingPolicyID>11111111111</chargingPolicyID>
			<chargingExecutionID>
				<chargingExecutionID>222222222222222</chargingExecutionID>
				<chargingPoint>0</chargingPoint>
				<chargeParty>0</chargeParty>
				<subOption>0</subOption>
				<presentOption>0</presentOption>
			</chargingExecutionID>
			<chargingModeID>
				<chargingModeID>333333333333333333</chargingModeID>
				<usageLimited>0</usageLimited>
				<usageType>0</usageType>
				<timeLimited>0</timeLimited>
				<timeStartValue>20101103100000</timeStartValue>
				<timeEndValue>20101104100000</timeEndValue>
				<moneyLimited>0</moneyLimited>
				<moneyStartValue>222</moneyStartValue>
				<moneyEndValue>333</moneyEndValue>
				<chargingCycle>0</chargingCycle>
				<canUse>0</canUse>
				<subscriptionExtend>0</subscriptionExtend>
				<baseFee>345</baseFee>
				<usageStartValue>aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa</usageStartValue>
				<usageEndValue>aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa</usageEndValue>
				<FeeType>0</FeeType>
				<amount>0</amount>
				<firstMonth>0</firstMonth>
			</chargingModeID>
				<chargingModeID>
				<chargingModeID>4444444444444444</chargingModeID>
				<usageLimited>1</usageLimited>
				<usageType>1</usageType>
				<timeLimited>1</timeLimited>
				<timeStartValue>20101103100022</timeStartValue>
				<timeEndValue>20101104100033</timeEndValue>
				<moneyLimited>1</moneyLimited>
				<moneyStartValue>444</moneyStartValue>
				<moneyEndValue>555</moneyEndValue>
				<chargingCycle>1</chargingCycle>
				<canUse>1</canUse>
				<subscriptionExtend>1</subscriptionExtend>
				<baseFee>789</baseFee>
				<usageStartValue>bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb</usageStartValue>
				<usageEndValue>vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv</usageEndValue>
				<FeeType>1</FeeType>
				<amount>1</amount>
				<firstMonth>1</firstMonth>
			</chargingModeID>
			<DOverD>0</DOverD>
			<discountInfo>
				<discountIDtype>
					<discountID>777777777777777777777</discountID>
					<discountType>0</discountType>
					<priority>0</priority>
					<startTime>20101203100022</startTime>
					<endTime>20101204100022</endTime>
					<date>20101103</date>
					<day>0</day>
					<holiday>20101103</holiday>
					<usageType>0</usageType>
					<usage>0</usage>
					<userType>001</userType>
					<userType>002</userType>
					<userType>003</userType>
					<serviceList>123</serviceList>
					<serviceList>345</serviceList>
					<serviceList>567</serviceList>
					<totalValueUnit>0</totalValueUnit>
					<totalValue>4445555</totalValue>
					<radix>0</radix>
					<productID>5555</productID>
					<productID>6666</productID>
					<productID>7777</productID>
					<returnType>0</returnType>
					<returnValue>66666666</returnValue>
					<accumulative>0</accumulative>
					<returnPoint>0</returnPoint>
				</discountIDtype>
				<effectiveTime>20101103100100</effectiveTime>
				<expireTime>20101103100134</expireTime>
			</discountInfo>
			<discountInfo>
				<discountIDtype>
					<discountID>888888888888888888</discountID>
					<discountType>1</discountType>
					<priority>1</priority>
					<startTime>20101207100022</startTime>
					<endTime>20101210100022</endTime>
					<date>20101104</date>
					<day>1</day>
					<holiday>20101105</holiday>
					<usageType>1</usageType>
					<usage>1</usage>
					<userType>101</userType>
					<userType>102</userType>
					<userType>103</userType>
					<serviceList>1234</serviceList>
					<serviceList>3456</serviceList>
					<serviceList>5679</serviceList>
					<totalValueUnit>0</totalValueUnit>
					<totalValue>7778888</totalValue>
					<radix>1</radix>
					<productID>555533</productID>
					<productID>666633</productID>
					<productID>777733</productID>
					<returnType>1</returnType>
					<returnValue>7777777</returnValue>
					<accumulative>1</accumulative>
					<returnPoint>1</returnPoint>
				</discountIDtype>
				<effectiveTime>20101203100100</effectiveTime>
				<expireTime>20101203100134</expireTime>
			</discountInfo>
		</ChargingPolicySynFromISMPReq>
	</SessionBody>
</Request>
]]>					
			</request>
		</m:ChargingPolicySyncFromISMPReq>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
